app/Models/CourseModel.php

    public function getCourse($id = false)
    {
        if($id == false)
        {
            return $this->findAll();
        }

        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `course`
WHERE `id` = '5'
 LIMIT 1

    public function getCourseByCategory($category)
    {
        return $this->where('kategori', $category)->findAll();
---
SELECT *
FROM `course`
WHERE `kategori` = 'Fotografi dan Video'