app/Models/PenggunaModel.php

    public function getPenggunaByUsername($username)
    {
        return $this->where(['username' => $username])->first();
---
SELECT *
FROM `pengguna`
WHERE `username` = 'nyomanari21'
 LIMIT 1