app/Models/TransaksiModel.php

    public function getTransaksiByUsername($username)
    {
        return $this->where(['username' => $username])->findAll();
---
SELECT *
FROM `transaksi`
WHERE `username` = 'nyomanari21'

    public function getTransaksiByCreator($username)
    {
        return $this->where(['kreator' => $username])->findAll();
---
SELECT *
FROM `transaksi`
WHERE `kreator` = 'rudi'